app/controllers/infos_controller.rb

  def friends

    @user = Member.find(params[:id])
---
SELECT * FROM `members` WHERE (`members`.`id` = 5)