app/controllers/invites_controller.rb

SELECT * FROM `members` WHERE (`members`.`id` = 1) LIMIT 1
INSERT INTO `invites` (`message`, `accepted_at`, `updated_at`, `code`, `member_id`, `member_id_target`, `is_accepted`, `created_at`) VALUES('clement dubois souhaite devenir votre ami', NULL, '2010-02-27 16:55:24', NULL, 1, 3, NULL, '2010-02-27 16:55:24')
---
  def create
    message = current_member.first_name+" "+current_member.last_name+" souhaite devenir votre ami"

    member_target = Member.find(params[:member_target])
    @invite = Invite.create(:member => current_member, :member_target => member_target, :message => message)

SELECT * FROM `invites` WHERE (`invites`.`id` = 5)
UPDATE `invites` SET `is_accepted` = 1, `updated_at` = '2010-03-05 08:21:05', `accepted_at` = '2010-03-05 08:21:05' WHERE `id` = 35
SELECT * FROM `members` WHERE (`members`.`id` = 1) LIMIT 1
---
  def accept
    invitation = Invite.find(params[:id])
    invitation.is_accepted = true
    invitation.accepted_at = Time.now
    invitation.save

    member = Member.find(invitation.member_id)

SELECT * FROM `invites` WHERE (`invites`.`id` = 2)
UPDATE `invites` SET `is_accepted` = 0, `updated_at` = '2010-03-03 20:54:30', `accepted_at` = '2010-03-03 20:54:30' WHERE `id` = 33
SELECT * FROM `members` WHERE (`members`.`id` = 2) LIMIT 1
---
  def refuse
    invitation = Invite.find(params[:id])
    invitation.is_accepted = false
    invitation.accepted_at = Time.now
    invitation.save

    member = Member.find(invitation.member_id)

SELECT * FROM `invites` WHERE (`invites`.`id` = 3)
DELETE FROM `invites` WHERE (`id` IN (3))
---
  def destroy
    invite = Invite.find(params[:id])

    if invite.is_accepted.nil?
      invite.delete

SELECT * FROM `invites` WHERE (`invites`.`id` = 2)
UPDATE `invites` SET `is_accepted` = 0, `updated_at` = '2010-03-01 22:57:27' WHERE `id` = 12
SELECT * FROM `members` WHERE (`members`.`id` = 1) LIMIT 1
---
  def cancel
    invitation = Invite.find(params[:id])
    invitation.is_accepted = false
    invitation.save

    member = Member.find(invitation.member_id)