app/controllers/members_controller.rb

  def edit
    @member = current_member
    @friends = @member.friends

    @invites_in = @member.invites_in.all(:conditions => {:is_accepted => nil})
---
SELECT * FROM `invites` WHERE (`invites`.`is_accepted` IS NULL) AND (`invites`.member_id_target = 2)

  def add
    member = Member.create(params[:member])
    member.save(false)

    if params[:promotion1]
      line = member.line_curriculum.create(:place_id => Promotion.all(:conditions => {:year => params[:promotion1][:year1], :degree => params[:promotion1][:degree1]}),
                                    :member_id => member.id, :place_type => "Promotion")
---
SELECT * FROM `promotions` WHERE (`promotions`.`year` IN ('247') AND `promotions`.`degree` IN ('247'))