app/controllers/members_controller.rb

SELECT * FROM `members` WHERE (`members`.`state` = 'active')
---
  def index
    @member = Member.new
    @members = Member.all(:conditions => {:state => 'active'})

SELECT * FROM `invites` WHERE (`invites`.`is_accepted` IS NULL) AND (`invites`.member_id_target = 31)
---
  def show
    @friends = @member.friends

    @invites_in = @member.invites_in.all(:conditions => {:is_accepted => nil})

SELECT * FROM `members` WHERE (`members`.`first_name` = 'clement' AND `members`.`activation_code` = 'azerty') LIMIT 1
SELECT `members`.id FROM `members` WHERE (`members`.`login` = BINARY '' AND `members`.id <> 1) LIMIT 1
UPDATE `members` SET `crypted_password` = 'a9b2f8526e33854e1538515385a5d9759e2f31c4', `town` = 'cannes-ecluse', `civil_state` = 'm', `last_name` = 'dubois', `region` = 'ile de france', `zipcode` = '77130', `email` = 'wakkabest@hotmail.com', `updated_at` = '2010-02-27 16:26:27' WHERE `id` = 1
---
  def create
    #Find member in the database that have the first and the activation_code indicated in the subscription field
    @member = Member.first(:conditions => {:first_name => params[:member][:first_name], :activation_code => params[:member][:activation_code]})
    @member ||= Member.new

    find = true unless @member.nil?
    find = false if @member.nil?

    respond_to do |format|
      if(find && @member.state != "active") #if a member with the first name and the activation_code is find, it means that we can activate him

        #we can update the informations
        if params[:member][:login].empty?
          params[:member][:login] = params[:member][:activation_code]
        end
        if @member.update_attributes(params[:member])

UPDATE `members` SET `town` = 'pétaouchnok les bains', `region` = 'franche compté', `zipcode` = '00000', `email` = 'admin_mail@admin.com', `updated_at` = '2010-03-10 19:47:06' WHERE `id` = 5
SELECT * FROM `line_curriculums` WHERE (`line_curriculums`.place_id = 5 AND `line_curriculums`.place_type = 'School') LIMIT 1
SELECT `schools`.* FROM `schools` INNER JOIN `line_curriculums` ON `schools`.id = `line_curriculums`.place_id AND `line_curriculums`.place_type = 'School' WHERE ((`line_curriculums`.member_id = 36))
UPDATE `schools` SET `updated_at` = '2010-03-13 12:25:07', `name` = 'truc' WHERE `id` = 7
---
  def update
    @member = current_member

    respond_to do |format|
      if @member.update_attributes(params[:member])
        params[:member][:schools_attributes].each do |number|
          @member.schools[number[0].to_i].line_curriculums.first.update_attributes(:beginning_year => params[:line][number[0]][:beginning_year],
                                :ending_year => params[:line][number[0]][:ending_year])

DELETE FROM `members` WHERE `id` = 4
---
  def destroy
    @member.destroy

INSERT INTO `members` (`salt`, `updated_at`, `region`, `crypted_password`, `zipcode`, `activation_code`, `remember_token_expires_at`, `town`, `remember_token`, `first_name`, `login`, `last_name`, `civil_state`, `state`, `email`, `created_at`) VALUES(NULL, '2010-03-06 07:24:05', NULL, NULL, NULL, 'azerty', NULL, NULL, NULL, 'truc', '', 'truc', NULL, 'pending', NULL, '2010-03-06 07:24:05')
SELECT * FROM `promotions` WHERE (`promotions`.`degree` = 'DUT Informatique') LIMIT 1
INSERT INTO `line_curriculums` (`place_type`, `place_id`, `updated_at`, `member_id`, `beginning_year`, `ending_year`, `created_at`) VALUES(NULL, 1, '2010-03-07 12:41:21', 11, NULL, NULL, '2010-03-07 12:41:21')
INSERT INTO `promotions` (`degree`, `updated_at`, `year`, `created_at`) VALUES('--- \n- DUT Informatique\n', '2010-03-09 12:54:48', '--- \n- \"1970\"\n', '2010-03-09 12:54:48')
---
  def add
    member = Member.create(params[:member])
    member.save(false)
    unless params[:promotion1][:year1].empty? && params[:promotion1][:degree1].empty?
      promotion = Promotion.find_by_degree(params[:promotion1][:degree1])
      logger.debug promotion.to_yaml
      promo = member.line_curriculums.create(:ending_year => params[:promotion1][:year1],
                                             :beginning_year => params[:promotion1][:year1].to_i-2,
                                             :place_id => promotion.id,
                                             :place_type => "Promotion")

SELECT * FROM `members` WHERE (`members`.`id` = 31) LIMIT 1
---
  def find_member
    @member = Member.find(params[:id])