app/controllers/messages_controller.rb

SELECT * FROM `conversations`
---
  def index

    @conversations = []

    Conversation.all.each do |conversation|

SELECT * FROM `conversations` WHERE (`conversations`.`id` = 20)
---
  def show
    @conversation = Conversation.find(params[:id])

SELECT * FROM `members` WHERE (`members`.`login` = 'bla')
---
  def create

    if admin?(current_member) && params[:Destinataires] == "all"
      send_all(params)
      return
    end

    recipients = []
    params[:Destinataires].split(",").each do |dest|
      if Member.all(:conditions => {:login => dest}).first

SELECT * FROM `conversations` WHERE (`conversations`.`id` = 6)
SELECT * FROM `messages` WHERE (`messages`.conversation_id = 6) ORDER BY created_at LIMIT 1
---
  def reply(params)

    current_member.reply_to_conversation(Conversation.find(params[:conversation_id]), params[:message])

SELECT * FROM `members` WHERE (`members`.`state` = '--- :active\n')
---
  def send_all(params)

    recipients = Member.all(:conditions => {:state => "active"})